Tekla Open API Reference for Tekla Structures 2025
DetailMarkSymbolAttributes Class
 The DetailMarkSymbolAttributes class is for detail mark attributes related to the shape of the connecting symbol.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes
 Tekla.Structures.Drawing.DetailMarkSymbolAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class DetailMarkSymbolAttributes : ViewMarkBasicSymbolAttributes
Public NotInheritable Class DetailMarkSymbolAttributes
	Inherits ViewMarkBasicSymbolAttributes
The DetailMarkSymbolAttributes type exposes the following members.
Constructors
Name | Description
DetailMarkSymbolAttributes
Initializes a new instance of the DetailMarkSymbolAttributes class
Top
Properties
Name | Description
Shape
 The shape of the mark symbol.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Size
 The size of the mark symbol.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace